GitConverter/src/Catalogs/ВерсииХранилища/ВерсииХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииХранилища</name>
  <owners>Catalog.ХранилищаКонфигураций</owners>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>CatalogRef.ОчередиВыполнения</types>
      <types>CatalogRef.КопииХранилищКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GitConverter/src/Enums/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсии</name>
  <enumValues>
    <name>ПолучениеВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВерсияПолучена</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВерсияВыгружена</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаМетаданных</name>
  </enumValues>
  <enumValues>
    <name>МетаданныеЗагружены</name>
  </enumValues>
  <enumValues>
    <name>НачалоКоммита</name>
  </enumValues>
  <enumValues>
    <name>ВерсияПомещена</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Catalogs/ВерсииХранилища/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
	
		Элементы.Владелец.Видимость = Ложь;
		
	КонецЕсли; 
	
	Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Справочники.ВерсииХранилища.ПустаяСсылка());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСостояниеВерсияПолучена(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ВерсияПолучена");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеВерсияВыгружена(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ВерсияВыгружена");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеМетаданныеЗагружены(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "МетаданныеЗагружены");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьСостояние(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ПустаяСсылка");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьСостояниеНаСервере(Знач ВыделенныеСтроки, Знач Состояние)
	
	Если НЕ ЗначениеЗаполнено(Состояние) ИЛИ ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние = "ПустаяСсылка" Тогда
	
		СостояниеСсылка = Перечисления.СостоянияВерсии.ПустаяСсылка();
	
	Иначе
	
		СостояниеСсылка = Перечисления.СостоянияВерсии[Состояние];
	
	КонецЕсли; 
	
	
	Для Каждого Ссылка Из ВыделенныеСтроки Цикл
		ВерсияОбъект = Ссылка.ПолучитьОбъект();
		ВерсияОбъект.Состояние = СостояниеСсылка;
		ВерсияОбъект.ВыгрузкаИзменений = Ложь;
		ВерсияОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииВыделенныеСтроки()

	Для Каждого Ссылка Из Элементы.Список.ВыделенныеСтроки Цикл
		ОповеститьОбИзменении(Ссылка);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
